iconv -f WINDOWS-1251 -t UTF-8 "./result.txt" >tmp
mv tmp "./result.txt"
iconv -f WINDOWS-1251 -t UTF-8 "./бухгалтерия права/Большой бухгалтерский словарь.htm" >tmp
mv tmp "./бухгалтерия права/Большой бухгалтерский словарь.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./бухгалтерия права/Правовой режим и бухгалтерский учет имущества предприятий.htm" >tmp
mv tmp "./бухгалтерия права/Правовой режим и бухгалтерский учет имущества предприятий.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./бухгалтерия права/Судебная бухгалтерия  Методические указания.htm" >tmp
mv tmp "./бухгалтерия права/Судебная бухгалтерия  Методические указания.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Google Dance в деталях от А до Я.htm" >tmp
mv tmp "./компьютер и интернет/Google Dance в деталях от А до Я.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Java-script .htm" >tmp
mv tmp "./компьютер и интернет/Java-script .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/JBuilder для начинающих.htm" >tmp
mv tmp "./компьютер и интернет/JBuilder для начинающих.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/PHP  регулярные выражения .htm" >tmp
mv tmp "./компьютер и интернет/PHP  регулярные выражения .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/PHP - препроцессор гипертекстового протокола.htm" >tmp
mv tmp "./компьютер и интернет/PHP - препроцессор гипертекстового протокола.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/PHP - русский F.A.Q.htm" >tmp
mv tmp "./компьютер и интернет/PHP - русский F.A.Q.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/PHP часто задаваемые вопросы [на английском].htm" >tmp
mv tmp "./компьютер и интернет/PHP часто задаваемые вопросы [на английском].htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Visual Basic + HTML = VBScript.htm" >tmp
mv tmp "./компьютер и интернет/Visual Basic + HTML = VBScript.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/VRML в примерах .htm" >tmp
mv tmp "./компьютер и интернет/VRML в примерах .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Ален И. Голуб - Правила программирования на Си и Си++.htm" >tmp
mv tmp "./компьютер и интернет/Ален И. Голуб - Правила программирования на Си и Си++.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Введение в Perl.htm" >tmp
mv tmp "./компьютер и интернет/Введение в Perl.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Введение в PHP.htm" >tmp
mv tmp "./компьютер и интернет/Введение в PHP.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Имидж компании в Интернет - что это такое .htm" >tmp
mv tmp "./компьютер и интернет/Имидж компании в Интернет - что это такое .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Использование шаблонов в PHP-4.htm" >tmp
mv tmp "./компьютер и интернет/Использование шаблонов в PHP-4.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Лёгкая смена дизайна с помощью PHP.htm" >tmp
mv tmp "./компьютер и интернет/Лёгкая смена дизайна с помощью PHP.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Низкоуровневое программирование современных видеокарт.htm" >tmp
mv tmp "./компьютер и интернет/Низкоуровневое программирование современных видеокарт.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Примеры безопасного программирования веб-приложений на PHP.htm" >tmp
mv tmp "./компьютер и интернет/Примеры безопасного программирования веб-приложений на PHP.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Примеры лучших скриптов на Java.htm" >tmp
mv tmp "./компьютер и интернет/Примеры лучших скриптов на Java.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Программирование на Java-script.htm" >tmp
mv tmp "./компьютер и интернет/Программирование на Java-script.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Система поддержки принятия решений на базе универсального экспертного комплекса.htm" >tmp
mv tmp "./компьютер и интернет/Система поддержки принятия решений на базе универсального экспертного комплекса.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/СТАНДАРТНАЯ ОБЩЕДОСТУПНАЯ ЛИЦЕНЗИЯ GNU.htm" >tmp
mv tmp "./компьютер и интернет/СТАНДАРТНАЯ ОБЩЕДОСТУПНАЯ ЛИЦЕНЗИЯ GNU.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Что нового в PHP-4.htm" >tmp
mv tmp "./компьютер и интернет/Что нового в PHP-4.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Язык программирования Java.htm" >tmp
mv tmp "./компьютер и интернет/Язык программирования Java.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./компьютер и интернет/Язык программирования XML .htm" >tmp
mv tmp "./компьютер и интернет/Язык программирования XML .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Назначение более мягкого показания, чем предусмотрено за данное преступление .htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Назначение более мягкого показания, чем предусмотрено за данное преступление .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Назначение более мягкого показания, чем предусмотрено за данное преступление.htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Назначение более мягкого показания, чем предусмотрено за данное преступление.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Обстоятельства, отягчающие наказание .htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Обстоятельства, отягчающие наказание .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Обстоятельства, смягчающие наказание.htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Обстоятельства, смягчающие наказание.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Общие начала назначения наказания .htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Общие начала назначения наказания .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Особенности назначения наказания при вердикте присяжных заседателей о снисхождении.htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Особенности назначения наказания при вердикте присяжных заседателей о снисхождении.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право России - Смертная казнь.htm" >tmp
mv tmp "./уголовное право России/Уголовное право России - Смертная казнь.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право РФ - Арест и Содержание в дисциплинарной воинской части.htm" >tmp
mv tmp "./уголовное право России/Уголовное право РФ - Арест и Содержание в дисциплинарной воинской части.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право РФ - Конфискация имущества.htm" >tmp
mv tmp "./уголовное право России/Уголовное право РФ - Конфискация имущества.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право РФ - Пожизненное лишение свободы .htm" >tmp
mv tmp "./уголовное право России/Уголовное право РФ - Пожизненное лишение свободы .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./уголовное право России/Уголовное право РФ - Понятие ограничения свободы .htm" >tmp
mv tmp "./уголовное право России/Уголовное право РФ - Понятие ограничения свободы .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Бизнес под ключ.htm" >tmp
mv tmp "./экономика и маркетинг/Бизнес под ключ.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Бюджетирование как инструмент управления эффективностью предприятия.htm" >tmp
mv tmp "./экономика и маркетинг/Бюджетирование как инструмент управления эффективностью предприятия.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Варианты финансирования бизнеса.htm" >tmp
mv tmp "./экономика и маркетинг/Варианты финансирования бизнеса.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Главные ошибки марксизма и пути их преодоления.htm" >tmp
mv tmp "./экономика и маркетинг/Главные ошибки марксизма и пути их преодоления.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Директ-маркетинг  Вопрос  Ответ!.htm" >tmp
mv tmp "./экономика и маркетинг/Директ-маркетинг  Вопрос  Ответ!.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Как победить конкурентов, не снижая цен.htm" >tmp
mv tmp "./экономика и маркетинг/Как победить конкурентов, не снижая цен.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Как придумать яркую «ФИШКУ».htm" >tmp
mv tmp "./экономика и маркетинг/Как придумать яркую «ФИШКУ».htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Насколько оптимизация маркетинговых затрат может увеличить прибыль компании.htm" >tmp
mv tmp "./экономика и маркетинг/Насколько оптимизация маркетинговых затрат может увеличить прибыль компании.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Рыночный социализм - будущее всего человечества.htm" >tmp
mv tmp "./экономика и маркетинг/Рыночный социализм - будущее всего человечества.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Тысячелетний научный курьёз.htm" >tmp
mv tmp "./экономика и маркетинг/Тысячелетний научный курьёз.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Управление стоимостью  не роскошь, а необходимость.htm" >tmp
mv tmp "./экономика и маркетинг/Управление стоимостью  не роскошь, а необходимость.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Управленческий учет на успешных российских предприятиях.htm" >tmp
mv tmp "./экономика и маркетинг/Управленческий учет на успешных российских предприятиях.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Форма собственности 21 века, или равновесие рынка труда.htm" >tmp
mv tmp "./экономика и маркетинг/Форма собственности 21 века, или равновесие рынка труда.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Цену нужно создавать, а не разрушать.htm" >tmp
mv tmp "./экономика и маркетинг/Цену нужно создавать, а не разрушать.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Что собой представляет новейшая пирамида Мавроди МММ - описание ее функционирования.htm" >tmp
mv tmp "./экономика и маркетинг/Что собой представляет новейшая пирамида Мавроди МММ - описание ее функционирования.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика и маркетинг/Эксперименты в маркетинговых исследованиях..htm" >tmp
mv tmp "./экономика и маркетинг/Эксперименты в маркетинговых исследованиях..htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Андрей Фурсенко - О реформировании системы образования .htm" >tmp
mv tmp "./экономика России сфера образования/Андрей Фурсенко - О реформировании системы образования .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Болонский процесс и профобразование .htm" >tmp
mv tmp "./экономика России сфера образования/Болонский процесс и профобразование .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Болонский процесс и профобразование.htm" >tmp
mv tmp "./экономика России сфера образования/Болонский процесс и профобразование.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Необходимость информатизации образования, как ответ запросам экономики и современного общества .htm" >tmp
mv tmp "./экономика России сфера образования/Необходимость информатизации образования, как ответ запросам экономики и современного общества .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Новый подход к образованию  качество и эффективность.htm" >tmp
mv tmp "./экономика России сфера образования/Новый подход к образованию  качество и эффективность.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/О приоритетных направлениях развития образовательной системы Российской Федерации .htm" >tmp
mv tmp "./экономика России сфера образования/О приоритетных направлениях развития образовательной системы Российской Федерации .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Образование - Hа пути к исследовательскому университету .htm" >tmp
mv tmp "./экономика России сфера образования/Образование - Hа пути к исследовательскому университету .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Образование на международном уровне .htm" >tmp
mv tmp "./экономика России сфера образования/Образование на международном уровне .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Пол Нортон - Британия ждет российских студентов.htm" >tmp
mv tmp "./экономика России сфера образования/Пол Нортон - Британия ждет российских студентов.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Российское образование  лицом к обществу .htm" >tmp
mv tmp "./экономика России сфера образования/Российское образование  лицом к обществу .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Российское образование  лицом к обществу.htm" >tmp
mv tmp "./экономика России сфера образования/Российское образование  лицом к обществу.htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/РОССИЙСКОЕ ОБРАЗОВАНИЕ С МЕЖДУНАРОДНЫМ КОМПОНЕНТОМ .htm" >tmp
mv tmp "./экономика России сфера образования/РОССИЙСКОЕ ОБРАЗОВАНИЕ С МЕЖДУНАРОДНЫМ КОМПОНЕНТОМ .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Сергей Мясоедов - Проблема взаимодействия академического и бизнес-образования .htm" >tmp
mv tmp "./экономика России сфера образования/Сергей Мясоедов - Проблема взаимодействия академического и бизнес-образования .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Центр Образования, Науки и Культуры РГСУ г. Нефтеюганск   .htm" >tmp
mv tmp "./экономика России сфера образования/Центр Образования, Науки и Культуры РГСУ г. Нефтеюганск   .htm"
iconv -f WINDOWS-1251 -t UTF-8 "./экономика России сфера образования/Экономика, основанная на знаниях.htm" >tmp
mv tmp "./экономика России сфера образования/Экономика, основанная на знаниях.htm"
